Revit 2024 API
MEPSystem.HasDesignParts Property
 Indicates if the system has one or more design parts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public bool HasDesignParts { get; }
Visual Basic
Public ReadOnly Property HasDesignParts As Boolean
	Get
Visual C++
public:
property bool HasDesignParts {
	bool get ();
}
See Also
MEPSystem Class
Autodesk.Revit.DB Namespace